[
  {
    "year": -2400,
    "event": "Earliest known settlements by Archaic Age hunter-gatherers on Antigua."
  },
  {
    "year": -500,
    "event": "Saladoid people from South America settle on the islands, introducing agriculture and pottery."
  },
  {
    "year": 1200,
    "event": "Island inhabited by Arawak and later Carib peoples before European contact."
  },
  {
    "year": 1493,
    "event": "Christopher Columbus sights Antigua during his second voyage to the Americas."
  },
  {
    "year": 1632,
    "event": "British colonists from St. Kitts establish first European settlement on Antigua."
  },
  {
    "year": 1667,
    "event": "Britain formally takes control of Antigua following Treaty of Breda."
  },
  {
    "year": 1684,
    "event": "Sir Christopher Codrington establishes the first large-scale sugar plantation using enslaved Africans."
  },
  {
    "year": 1834,
    "event": "Slavery abolished throughout the British Empire, including Antigua and Barbuda."
  },
  {
    "year": 1860,
    "event": "Antigua and Barbuda administered as part of the British Leeward Islands colony."
  },
  {
    "year": 1958,
    "event": "Joins the West Indies Federation, a short-lived political union of British Caribbean colonies."
  },
  {
    "year": 1962,
    "event": "West Indies Federation dissolves; Antigua becomes a separate British colony."
  },
  {
    "year": 1967,
    "event": "Achieves associated statehood with full internal self-government."
  },
  {
    "year": 1981,
    "event": "Antigua and Barbuda gains full independence from the United Kingdom on November 1."
  },
  {
    "year": 1994,
    "event": "Hurricane Luis causes significant damage to infrastructure and housing."
  },
  {
    "year": 2004,
    "event": "United Progressive Party wins elections, ending nearly 30 years of rule by the Bird family and the Antigua Labour Party."
  },
  {
    "year": 2017,
    "event": "Hurricane Irma devastates Barbuda, forcing evacuation of the island’s entire population."
  },
  {
    "year": 2020,
    "event": "COVID-19 pandemic affects tourism-dependent economy."
  }
]