[
  {
    "year": -12000,
    "event": "Indigenous peoples inhabit the land that will become Canada."
  },
  {
    "year": 1000,
    "event": "Norse explorer Leif Erikson establishes a settlement at L'Anse aux Meadows in Newfoundland."
  },
  {
    "year": 1497,
    "event": "John Cabot explores the coast of Newfoundland for England."
  },
  {
    "year": 1534,
    "event": "Jacques Cartier claims the Gaspé Peninsula for France, beginning French exploration."
  },
  {
    "year": 1608,
    "event": "Samuel de Champlain founds Quebec City."
  },
  {
    "year": 1713,
    "event": "Treaty of Utrecht cedes parts of French territory in Canada to Britain."
  },
  {
    "year": 1756,
    "event": "Start of the Seven Years’ War (French and Indian War in North America)."
  },
  {
    "year": 1763,
    "event": "Treaty of Paris ends Seven Years' War; France cedes most of its North American territory to Britain."
  },
  {
    "year": 1774,
    "event": "Quebec Act recognizes French civil law and the Catholic religion in Quebec."
  },
  {
    "year": 1791,
    "event": "Constitutional Act splits Quebec into Upper Canada and Lower Canada."
  },
  {
    "year": 1812,
    "event": "War of 1812 between Britain (including Canadian forces) and the United States."
  },
  {
    "year": 1837,
    "event": "Rebellions in Upper and Lower Canada against colonial governance."
  },
  {
    "year": 1841,
    "event": "Upper and Lower Canada united into the Province of Canada."
  },
  {
    "year": 1867,
    "event": "Confederation: Canada becomes a self-governing dominion with four provinces."
  },
  {
    "year": 1870,
    "event": "Manitoba becomes a province; Northwest Territories acquired by Canada."
  },
  {
    "year": 1871,
    "event": "British Columbia joins Confederation."
  },
  {
    "year": 1885,
    "event": "Completion of the Canadian Pacific Railway; North-West Rebellion led by Louis Riel."
  },
  {
    "year": 1896,
    "event": "Klondike Gold Rush begins."
  },
  {
    "year": 1914,
    "event": "Canada enters World War I as part of the British Empire."
  },
  {
    "year": 1919,
    "event": "Canada signs Treaty of Versailles independently, joining the League of Nations."
  },
  {
    "year": 1931,
    "event": "Statute of Westminster grants Canada legislative independence from Britain."
  },
  {
    "year": 1939,
    "event": "Canada declares war on Germany, entering World War II independently."
  },
  {
    "year": 1960,
    "event": "Canadian Bill of Rights is enacted."
  },
  {
    "year": 1965,
    "event": "Canada adopts the maple leaf as its national flag."
  },
  {
    "year": 1980,
    "event": "First Quebec independence referendum fails."
  },
  {
    "year": 1982,
    "event": "Canada Act passed, patriating the constitution and enacting the Charter of Rights and Freedoms."
  },
  {
    "year": 1995,
    "event": "Second Quebec independence referendum narrowly fails."
  },
  {
    "year": 2008,
    "event": "Canadian government apologizes for residential school system abuses."
  },
  {
    "year": 2015,
    "event": "Justin Trudeau becomes Prime Minister."
  },
  {
    "year": 2021,
    "event": "Discovery of unmarked graves at former residential school sites sparks national reckoning."
  }
]