[
  {
    "year": -5000,
    "event": "Earliest evidence of human habitation by Guanahatabey and other indigenous peoples."
  },
  {
    "year": 1000,
    "event": "Taíno people, an Arawakan-speaking group, dominate most of the island."
  },
  {
    "year": 1492,
    "event": "Christopher Columbus lands on Cuba during his first voyage to the Americas."
  },
  {
    "year": 1511,
    "event": "Spanish begin colonization under Diego Velázquez de Cuéllar; indigenous resistance crushed."
  },
  {
    "year": 1526,
    "event": "First recorded importation of enslaved Africans to Cuba."
  },
  {
    "year": 1762,
    "event": "British capture Havana during the Seven Years’ War."
  },
  {
    "year": 1763,
    "event": "Havana returned to Spain in exchange for Florida under the Treaty of Paris."
  },
  {
    "year": 1868,
    "event": "Ten Years' War begins, first major Cuban war for independence from Spain."
  },
  {
    "year": 1878,
    "event": "Ten Years' War ends in failure; Spain retains control."
  },
  {
    "year": 1895,
    "event": "José Martí leads renewed fight for independence; Cuban War of Independence begins."
  },
  {
    "year": 1898,
    "event": "Spanish-American War leads to U.S. intervention; Spain loses control of Cuba."
  },
  {
    "year": 1902,
    "event": "Cuba formally gains independence but remains under U.S. influence via the Platt Amendment."
  },
  {
    "year": 1933,
    "event": "Sergeants' Revolt overthrows President Gerardo Machado; rise of Fulgencio Batista."
  },
  {
    "year": 1952,
    "event": "Batista seizes power in a military coup."
  },
  {
    "year": 1953,
    "event": "Fidel Castro leads failed attack on Moncada Barracks; beginning of Cuban Revolution."
  },
  {
    "year": 1959,
    "event": "Castro and revolutionary forces overthrow Batista; establish communist state."
  },
  {
    "year": 1961,
    "event": "Bay of Pigs Invasion by U.S.-backed exiles fails to topple Castro."
  },
  {
    "year": 1962,
    "event": "Cuban Missile Crisis brings U.S. and USSR to the brink of nuclear war."
  },
  {
    "year": 1980,
    "event": "Mariel boatlift: over 100,000 Cubans emigrate to the U.S."
  },
  {
    "year": 1991,
    "event": "Collapse of Soviet Union triggers economic crisis known as the 'Special Period'."
  },
  {
    "year": 2006,
    "event": "Fidel Castro hands power to his brother Raúl Castro due to illness."
  },
  {
    "year": 2015,
    "event": "U.S. and Cuba restore diplomatic relations after decades of hostility."
  },
  {
    "year": 2018,
    "event": "Miguel Díaz-Canel becomes president, succeeding Raúl Castro."
  },
  {
    "year": 2021,
    "event": "Mass protests erupt over economic hardship and lack of freedoms."
  }
]