[
  {
    "year": -3000,
    "event": "First human settlements by Archaic peoples."
  },
  {
    "year": 1000,
    "event": "Island inhabited by Arawak people, later displaced by Kalinago (Caribs)."
  },
  {
    "year": 1493,
    "event": "Christopher Columbus sights the island on November 3 during his second voyage."
  },
  {
    "year": 1635,
    "event": "France claims Dominica but faces resistance from the indigenous Kalinago people."
  },
  {
    "year": 1763,
    "event": "Treaty of Paris grants Britain control of Dominica after the Seven Years' War."
  },
  {
    "year": 1778,
    "event": "France briefly recaptures Dominica during the American Revolutionary War."
  },
  {
    "year": 1783,
    "event": "Treaty of Paris restores Dominica to Britain."
  },
  {
    "year": 1834,
    "event": "Slavery abolished in the British Empire; Dominica becomes the first British Caribbean colony to have a Black-controlled legislature."
  },
  {
    "year": 1865,
    "event": "Black majority in the legislature removed by Britain amid tensions and reforms."
  },
  {
    "year": 1958,
    "event": "Dominica joins the West Indies Federation."
  },
  {
    "year": 1962,
    "event": "Federation dissolves; Dominica reverts to British control as an associated state."
  },
  {
    "year": 1978,
    "event": "Dominica gains full independence from the United Kingdom on November 3."
  },
  {
    "year": 1979,
    "event": "Hurricane David causes widespread destruction and loss of life."
  },
  {
    "year": 1980,
    "event": "Mary Eugenia Charles becomes Prime Minister, the first female elected leader in the Caribbean."
  },
  {
    "year": 2004,
    "event": "Tropical Storm Jeanne causes flooding and damage."
  },
  {
    "year": 2015,
    "event": "Tropical Storm Erika causes significant damage to infrastructure and economy."
  },
  {
    "year": 2017,
    "event": "Hurricane Maria devastates Dominica, destroying 90% of buildings and displacing thousands."
  },
  {
    "year": 2020,
    "event": "COVID-19 pandemic hits Dominica’s tourism and economic sectors."
  }
]