[
  {
    "year": -1500,
    "event": "Early Mesoamerican cultures, including the Olmecs and later Pipil people, inhabit the region."
  },
  {
    "year": 1524,
    "event": "Spanish conquistadors led by Pedro de Alvarado begin the conquest of El Salvador."
  },
  {
    "year": 1540,
    "event": "El Salvador is fully incorporated into the Spanish Empire as part of the Captaincy General of Guatemala."
  },
  {
    "year": 1821,
    "event": "El Salvador declares independence from Spain along with other Central American provinces."
  },
  {
    "year": 1823,
    "event": "El Salvador joins the United Provinces of Central America."
  },
  {
    "year": 1838,
    "event": "El Salvador becomes fully independent after the dissolution of the Central American Federation."
  },
  {
    "year": 1931,
    "event": "Military coup brings General Maximiliano Hernández Martínez to power."
  },
  {
    "year": 1932,
    "event": "La Matanza: Thousands of indigenous people massacred after a peasant uprising."
  },
  {
    "year": 1969,
    "event": "El Salvador and Honduras fight the brief 'Football War' over immigration and land disputes."
  },
  {
    "year": 1979,
    "event": "Military coup sparks the beginning of the Salvadoran Civil War."
  },
  {
    "year": 1980,
    "event": "Archbishop Óscar Romero assassinated while saying Mass; becomes a martyr and later a saint."
  },
  {
    "year": 1981,
    "event": "Massacre at El Mozote where hundreds of civilians are killed by the army."
  },
  {
    "year": 1992,
    "event": "Peace accords signed between government and FMLN guerrillas, ending 12-year civil war."
  },
  {
    "year": 2001,
    "event": "U.S. dollar adopted as official currency."
  },
  {
    "year": 2009,
    "event": "Mauricio Funes becomes first leftist president from FMLN party."
  },
  {
    "year": 2014,
    "event": "Salvador Sánchez Cerén, former guerrilla leader, elected president."
  },
  {
    "year": 2021,
    "event": "El Salvador becomes first country in the world to adopt Bitcoin as legal tender."
  },
  {
    "year": 2022,
    "event": "President Nayib Bukele declares war on gangs, leading to mass arrests and security crackdown."
  }
]