[
  {
    "year": -1000,
    "event": "Early Mesoamerican cultures develop in the region; Maya settlements emerge in western Honduras."
  },
  {
    "year": 426,
    "event": "Maya city of Copán becomes a major center of the Classic Maya civilization."
  },
  {
    "year": 822,
    "event": "Final recorded date at Copán; Maya civilization begins to decline in the area."
  },
  {
    "year": 1502,
    "event": "Christopher Columbus lands on the coast of Honduras during his fourth voyage."
  },
  {
    "year": 1524,
    "event": "Spanish conquest of Honduras begins under Gil González Dávila and Hernán Cortés."
  },
  {
    "year": 1539,
    "event": "Honduras becomes part of the Spanish Captaincy General of Guatemala."
  },
  {
    "year": 1821,
    "event": "Honduras declares independence from Spain."
  },
  {
    "year": 1823,
    "event": "Joins the United Provinces of Central America."
  },
  {
    "year": 1838,
    "event": "Honduras becomes fully independent after the federation dissolves."
  },
  {
    "year": 1907,
    "event": "Central American Court of Justice established in Honduras."
  },
  {
    "year": 1963,
    "event": "Military coup ousts President Ramón Villeda Morales."
  },
  {
    "year": 1969,
    "event": "Brief war with El Salvador known as the 'Football War' over immigration and land issues."
  },
  {
    "year": 1982,
    "event": "New democratic constitution enacted; civilian rule restored."
  },
  {
    "year": 1998,
    "event": "Hurricane Mitch devastates Honduras, killing thousands and causing severe economic damage."
  },
  {
    "year": 2009,
    "event": "President Manuel Zelaya is ousted in a military-backed coup; political crisis ensues."
  },
  {
    "year": 2017,
    "event": "Disputed presidential election leads to widespread protests and violence."
  },
  {
    "year": 2020,
    "event": "Honduras struggles with the COVID-19 pandemic and devastation from Hurricanes Eta and Iota."
  },
  {
    "year": 2021,
    "event": "Xiomara Castro elected as Honduras's first female president."
  }
]