[
  {
    "year": -600,
    "event": "First known inhabitants are the Arawak and Taíno peoples from South America."
  },
  {
    "year": 1494,
    "event": "Christopher Columbus visits Jamaica on his second voyage to the Americas."
  },
  {
    "year": 1509,
    "event": "Spanish colonization begins; enslaved Africans brought to replace declining indigenous population."
  },
  {
    "year": 1655,
    "event": "British forces capture Jamaica from the Spanish."
  },
  {
    "year": 1670,
    "event": "Treaty of Madrid confirms British possession of Jamaica."
  },
  {
    "year": 1692,
    "event": "Port Royal, a major pirate haven, is destroyed by a massive earthquake."
  },
  {
    "year": 1831,
    "event": "Baptist War (Christmas Rebellion) led by Samuel Sharpe, a major slave uprising."
  },
  {
    "year": 1834,
    "event": "Slavery abolished throughout the British Empire; full emancipation by 1838."
  },
  {
    "year": 1865,
    "event": "Morant Bay Rebellion leads to direct British colonial rule."
  },
  {
    "year": 1944,
    "event": "New constitution grants universal adult suffrage."
  },
  {
    "year": 1958,
    "event": "Jamaica joins the West Indies Federation."
  },
  {
    "year": 1962,
    "event": "Jamaica gains full independence from the United Kingdom on August 6."
  },
  {
    "year": 1972,
    "event": "Michael Manley becomes Prime Minister, pursuing democratic socialism."
  },
  {
    "year": 1980,
    "event": "Political violence intensifies during election; Edward Seaga becomes Prime Minister."
  },
  {
    "year": 1992,
    "event": "P. J. Patterson becomes Jamaica’s first Black Prime Minister."
  },
  {
    "year": 2009,
    "event": "Economic reforms and IMF agreement signed during global financial crisis."
  },
  {
    "year": 2010,
    "event": "State of emergency declared amid manhunt for drug lord Christopher 'Dudus' Coke."
  },
  {
    "year": 2016,
    "event": "Andrew Holness elected Prime Minister, initiating new economic growth policies."
  },
  {
    "year": 2020,
    "event": "COVID-19 pandemic impacts tourism-dependent economy."
  }
]