[
  {
    "year": -2500,
    "event": "Beginning of Olmec civilization, considered the first major Mesoamerican culture."
  },
  {
    "year": -1000,
    "event": "Zapotec civilization emerges in the Valley of Oaxaca."
  },
  {
    "year": 250,
    "event": "Classic period of Teotihuacan, a major urban center near modern Mexico City."
  },
  {
    "year": 600,
    "event": "Decline of Teotihuacan; rise of city-states like Monte Albán and El Tajín."
  },
  {
    "year": 900,
    "event": "Toltec civilization flourishes in central Mexico."
  },
  {
    "year": 1325,
    "event": "Founding of Tenochtitlán by the Mexica (Aztecs)."
  },
  {
    "year": 1428,
    "event": "Formation of the Aztec Triple Alliance, leading to Aztec Empire dominance."
  },
  {
    "year": 1519,
    "event": "Hernán Cortés arrives on the coast of Mexico and begins the Spanish conquest."
  },
  {
    "year": 1521,
    "event": "Fall of Tenochtitlán; beginning of Spanish colonial rule."
  },
  {
    "year": 1535,
    "event": "Creation of the Viceroyalty of New Spain."
  },
  {
    "year": 1810,
    "event": "Miguel Hidalgo issues the Grito de Dolores, starting the Mexican War of Independence."
  },
  {
    "year": 1821,
    "event": "Mexico gains independence from Spain."
  },
  {
    "year": 1824,
    "event": "Federal Constitution of the United Mexican States enacted."
  },
  {
    "year": 1836,
    "event": "Texas declares independence from Mexico."
  },
  {
    "year": 1846,
    "event": "Mexican-American War begins."
  },
  {
    "year": 1848,
    "event": "Treaty of Guadalupe Hidalgo ends war; Mexico cedes large territories to the U.S."
  },
  {
    "year": 1862,
    "event": "Mexican forces defeat the French at the Battle of Puebla on May 5 (Cinco de Mayo)."
  },
  {
    "year": 1864,
    "event": "French install Emperor Maximilian I during Second Mexican Empire."
  },
  {
    "year": 1867,
    "event": "Republic restored under Benito Juárez; Maximilian executed."
  },
  {
    "year": 1876,
    "event": "Porfirio Díaz seizes power, beginning the Porfiriato era."
  },
  {
    "year": 1910,
    "event": "Mexican Revolution begins against Díaz’s dictatorship."
  },
  {
    "year": 1917,
    "event": "New Mexican Constitution adopted, still in effect today."
  },
  {
    "year": 1929,
    "event": "Founding of the Institutional Revolutionary Party (PRI), which dominates for decades."
  },
  {
    "year": 1968,
    "event": "Tlatelolco massacre occurs before the Olympics in Mexico City."
  },
  {
    "year": 1985,
    "event": "Major earthquake devastates Mexico City, killing thousands."
  },
  {
    "year": 1994,
    "event": "NAFTA (North American Free Trade Agreement) takes effect; Zapatista uprising in Chiapas."
  },
  {
    "year": 2000,
    "event": "End of PRI dominance with election of Vicente Fox from PAN."
  },
  {
    "year": 2006,
    "event": "Government launches war against drug cartels, escalating violence."
  },
  {
    "year": 2018,
    "event": "Andrés Manuel López Obrador (AMLO) elected president with a landslide victory."
  },
  {
    "year": 2020,
    "event": "COVID-19 pandemic severely impacts Mexico’s health system and economy."
  }
]