[
  {
    "year": -2500,
    "event": "First permanent settlements appear in present-day Panama by pre-Columbian indigenous peoples."
  },
  {
    "year": 1501,
    "event": "Rodrigo de Bastidas becomes the first European to explore the Panamanian coast."
  },
  {
    "year": 1502,
    "event": "Christopher Columbus explores Panama during his fourth voyage."
  },
  {
    "year": 1510,
    "event": "First permanent European settlement established at Santa María la Antigua del Darién."
  },
  {
    "year": 1513,
    "event": "Vasco Núñez de Balboa crosses the Isthmus of Panama and discovers the Pacific Ocean."
  },
  {
    "year": 1538,
    "event": "Panama becomes the seat of the Real Audiencia of Panama under Spanish rule."
  },
  {
    "year": 1821,
    "event": "Panama declares independence from Spain and joins Gran Colombia."
  },
  {
    "year": 1831,
    "event": "After breakup of Gran Colombia, Panama remains a department of Colombia."
  },
  {
    "year": 1846,
    "event": "Mallárino–Bidlack Treaty signed between U.S. and New Granada (Colombia), granting U.S. transit rights."
  },
  {
    "year": 1855,
    "event": "Panama Railway completed across the isthmus, first transcontinental railroad."
  },
  {
    "year": 1881,
    "event": "French attempt to build Panama Canal under Ferdinand de Lesseps begins, but fails by 1889."
  },
  {
    "year": 1903,
    "event": "With U.S. support, Panama declares independence from Colombia; Hay–Bunau-Varilla Treaty signed with U.S."
  },
  {
    "year": 1904,
    "event": "U.S. begins construction of the Panama Canal."
  },
  {
    "year": 1914,
    "event": "Panama Canal officially opens under U.S. control."
  },
  {
    "year": 1968,
    "event": "Military coup brings General Omar Torrijos to power."
  },
  {
    "year": 1977,
    "event": "Torrijos–Carter Treaties signed, agreeing to transfer control of Panama Canal to Panama by 1999."
  },
  {
    "year": 1989,
    "event": "U.S. invades Panama to remove General Manuel Noriega from power."
  },
  {
    "year": 1999,
    "event": "Panama assumes full control of the Panama Canal from the U.S."
  },
  {
    "year": 2016,
    "event": "Panama Papers leak exposes global tax evasion linked to Panamanian law firm Mossack Fonseca."
  },
  {
    "year": 2020,
    "event": "COVID-19 pandemic severely impacts Panama’s economy and healthcare system."
  }
]