[
  {
    "year": -500,
    "event": "Island first inhabited by Ciboney, then Arawak, and later the Carib (Kalinago) peoples."
  },
  {
    "year": 1499,
    "event": "Spanish explorers reportedly sight Saint Lucia; named by early Europeans."
  },
  {
    "year": 1605,
    "event": "English settlers attempt to colonize the island but are repelled by the Caribs."
  },
  {
    "year": 1650,
    "event": "French successfully establish a permanent settlement on Saint Lucia."
  },
  {
    "year": 1660,
    "event": "Treaty signed with the Caribs; French consolidate control."
  },
  {
    "year": 1663,
    "event": "British take control of Saint Lucia."
  },
  {
    "year": 1667,
    "event": "Treaty of Breda returns Saint Lucia to the French."
  },
  {
    "year": 18,
    "event": "Saint Lucia changes hands between France and Britain 14 times during the 18th century."
  },
  {
    "year": 1814,
    "event": "Treaty of Paris cedes Saint Lucia permanently to Britain."
  },
  {
    "year": 1834,
    "event": "Slavery abolished in the British Empire; enslaved population on Saint Lucia emancipated."
  },
  {
    "year": 1958,
    "event": "Joins the West Indies Federation."
  },
  {
    "year": 1967,
    "event": "Becomes an associated state of the UK with full internal self-government."
  },
  {
    "year": 1979,
    "event": "Saint Lucia gains full independence from the United Kingdom on February 22."
  },
  {
    "year": 1982,
    "event": "John Compton becomes Prime Minister, beginning a period of political stability."
  },
  {
    "year": 2004,
    "event": "Hurricane Ivan causes significant damage to the island."
  },
  {
    "year": 2010,
    "event": "Hurricane Tomas strikes Saint Lucia, causing fatalities and infrastructure damage."
  },
  {
    "year": 2016,
    "event": "Allen Chastanet elected Prime Minister following general elections."
  },
  {
    "year": 2021,
    "event": "Philip J. Pierre becomes Prime Minister amid continued economic recovery efforts."
  }
]